; ModuleID = 'test_header.cpp'
source_filename = "test_header.cpp"
target datalayout = "e-m:o-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-apple-macosx13.0.0"

; Function Attrs: mustprogress noinline norecurse nounwind optnone ssp uwtable
define i32 @main() #0 !dbg !1271 {
entry:
  %retval = alloca i32, align 4
  store i32 0, i32* %retval, align 4
  ret i32 0, !dbg !1273
}

attributes #0 = { mustprogress noinline norecurse nounwind optnone ssp uwtable "darwin-stkchk-strong-link" "frame-pointer"="all" "min-legal-vector-width"="0" "no-trapping-math"="true" "probe-stack"="___chkstk_darwin" "stack-protector-buffer-size"="8" "target-cpu"="penryn" "target-features"="+cx16,+cx8,+fxsr,+mmx,+sahf,+sse,+sse2,+sse3,+sse4.1,+ssse3,+x87" "tune-cpu"="generic" }

!llvm.module.flags = !{!0, !1, !2, !3, !4, !5, !6}
!llvm.dbg.cu = !{!7}
!llvm.ident = !{!1270}

!0 = !{i32 2, !"SDK Version", [2 x i32] [i32 13, i32 3]}
!1 = !{i32 7, !"Dwarf Version", i32 4}
!2 = !{i32 2, !"Debug Info Version", i32 3}
!3 = !{i32 1, !"wchar_size", i32 4}
!4 = !{i32 7, !"PIC Level", i32 2}
!5 = !{i32 7, !"uwtable", i32 2}
!6 = !{i32 7, !"frame-pointer", i32 2}

!72 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !73, file: !32, line: 169)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !63, line: 34, baseType: !50)
!74 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !75, file: !32, line: 170)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !63, line: 35, baseType: !54)
!76 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !77, file: !32, line: 171)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !63, line: 36, baseType: !58)
!78 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !79, file: !32, line: 173)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !63, line: 40, baseType: !29)
!80 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !81, file: !32, line: 174)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !63, line: 41, baseType: !34)
!82 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !83, file: !32, line: 175)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !63, line: 42, baseType: !38)
!84 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !85, file: !32, line: 176)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !63, line: 43, baseType: !42)
!86 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !87, file: !32, line: 178)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !63, line: 44, baseType: !46)
!88 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !89, file: !32, line: 179)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !63, line: 45, baseType: !50)
!90 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !91, file: !32, line: 180)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !63, line: 46, baseType: !54)
!92 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !93, file: !32, line: 181)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !63, line: 47, baseType: !58)
!94 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !95, file: !32, line: 183)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !96, line: 32, baseType: !97)
!96 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_intptr_t.h", directory: "")
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_intptr_t", file: !98, line: 51, baseType: !20)
!98 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/i386/_types.h", directory: "")
!99 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !100, file: !32, line: 184)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !101, line: 34, baseType: !23)
!101 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_uintptr_t.h", directory: "")
!102 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !103, file: !32, line: 186)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !104, line: 32, baseType: !20)
!104 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_intmax_t.h", directory: "")
!105 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !106, file: !32, line: 187)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !107, line: 32, baseType: !23)
!107 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_uintmax_t.h", directory: "")
!108 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !109, file: !121, line: 44)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !110, line: 32, baseType: !111)
!110 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_mbstate_t.h", directory: "")
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_mbstate_t", file: !98, line: 83, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !98, line: 81, baseType: !113)
!113 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !98, line: 78, size: 1024, flags: DIFlagTypePassByValue, elements: !114, identifier: "_ZTS11__mbstate_t")
!114 = !{!115, !120}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__mbstate8", scope: !113, file: !98, line: 79, baseType: !116, size: 1024)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !117, size: 1024, elements: !118)
!117 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!118 = !{!119}
!119 = !DISubrange(count: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_mbstateL", scope: !113, file: !98, line: 80, baseType: !44, size: 64)
!121 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/__mbstate_t.h", directory: "")
!122 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !22, file: !123, line: 94)
!123 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/cstdlib", directory: "")
!124 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !125, file: !123, line: 95)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !126, line: 86, baseType: !127)
!126 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/stdlib.h", directory: "")
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !126, line: 83, size: 64, flags: DIFlagTypePassByValue, elements: !128, identifier: "_ZTS5div_t")
!128 = !{!129, !130}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !127, file: !126, line: 84, baseType: !40, size: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !127, file: !126, line: 85, baseType: !40, size: 32, offset: 32)
!131 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !132, file: !123, line: 96)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !126, line: 91, baseType: !133)
!133 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !126, line: 88, size: 128, flags: DIFlagTypePassByValue, elements: !134, identifier: "_ZTS6ldiv_t")
!134 = !{!135, !136}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !133, file: !126, line: 89, baseType: !20, size: 64)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !133, file: !126, line: 90, baseType: !20, size: 64, offset: 64)
!137 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !138, file: !123, line: 97)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !126, line: 97, baseType: !139)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !126, line: 94, size: 128, flags: DIFlagTypePassByValue, elements: !140, identifier: "_ZTS7lldiv_t")
!140 = !{!141, !142}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !139, file: !126, line: 95, baseType: !44, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !139, file: !126, line: 96, baseType: !44, size: 64, offset: 64)
!143 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !144, file: !123, line: 98)
!144 = !DISubprogram(name: "atof", scope: !126, file: !126, line: 134, type: !145, flags: DIFlagPrototyped, spFlags: 0)
!145 = !DISubroutineType(types: !146)
!146 = !{!147, !148}
!147 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !149, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !117)
!150 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !151, file: !123, line: 99)
!151 = !DISubprogram(name: "atoi", scope: !126, file: !126, line: 135, type: !152, flags: DIFlagPrototyped, spFlags: 0)
!152 = !DISubroutineType(types: !153)
!153 = !{!40, !148}
!154 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !155, file: !123, line: 100)
!155 = !DISubprogram(name: "atol", scope: !126, file: !126, line: 136, type: !156, flags: DIFlagPrototyped, spFlags: 0)
!156 = !DISubroutineType(types: !157)
!157 = !{!20, !148}
!158 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !159, file: !123, line: 101)
!159 = !DISubprogram(name: "atoll", scope: !126, file: !126, line: 139, type: !160, flags: DIFlagPrototyped, spFlags: 0)
!160 = !DISubroutineType(types: !161)
!161 = !{!44, !148}
!162 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !163, file: !123, line: 102)
!163 = !DISubprogram(name: "strtod", linkageName: "\01_strtod", scope: !126, file: !126, line: 165, type: !164, flags: DIFlagPrototyped, spFlags: 0)
!164 = !DISubroutineType(types: !165)
!165 = !{!147, !148, !166}
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!168 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !169, file: !123, line: 103)
!169 = !DISubprogram(name: "strtof", linkageName: "\01_strtof", scope: !126, file: !126, line: 166, type: !170, flags: DIFlagPrototyped, spFlags: 0)
!170 = !DISubroutineType(types: !171)
!171 = !{!172, !148, !166}
!172 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!173 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !174, file: !123, line: 104)
!174 = !DISubprogram(name: "strtold", scope: !126, file: !126, line: 169, type: !175, flags: DIFlagPrototyped, spFlags: 0)
!175 = !DISubroutineType(types: !176)
!176 = !{!27, !148, !166}
!177 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !178, file: !123, line: 105)
!178 = !DISubprogram(name: "strtol", scope: !126, file: !126, line: 167, type: !179, flags: DIFlagPrototyped, spFlags: 0)
!179 = !DISubroutineType(types: !180)
!180 = !{!20, !148, !166, !40}
!181 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !182, file: !123, line: 106)
!182 = !DISubprogram(name: "strtoll", scope: !126, file: !126, line: 172, type: !183, flags: DIFlagPrototyped, spFlags: 0)
!183 = !DISubroutineType(types: !184)
!184 = !{!44, !148, !166, !40}
!185 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !186, file: !123, line: 107)
!186 = !DISubprogram(name: "strtoul", scope: !126, file: !126, line: 175, type: !187, flags: DIFlagPrototyped, spFlags: 0)
!187 = !DISubroutineType(types: !188)
!188 = !{!23, !148, !166, !40}
!189 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !190, file: !123, line: 108)
!190 = !DISubprogram(name: "strtoull", scope: !126, file: !126, line: 178, type: !191, flags: DIFlagPrototyped, spFlags: 0)
!191 = !DISubroutineType(types: !192)
!192 = !{!60, !148, !166, !40}
!193 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !194, file: !123, line: 109)
!194 = !DISubprogram(name: "rand", scope: !126, file: !126, line: 162, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!195 = !DISubroutineType(types: !196)
!196 = !{!40}
!197 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !198, file: !123, line: 110)
!198 = !DISubprogram(name: "srand", scope: !126, file: !126, line: 164, type: !199, flags: DIFlagPrototyped, spFlags: 0)
!199 = !DISubroutineType(types: !200)
!200 = !{null, !56}
!201 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !202, file: !123, line: 111)
!202 = !DISubprogram(name: "calloc", scope: !203, file: !203, line: 41, type: !204, flags: DIFlagPrototyped, spFlags: 0)
!203 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/malloc/_malloc.h", directory: "")
!204 = !DISubroutineType(types: !205)
!205 = !{!206, !22, !22}
!206 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!207 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !208, file: !123, line: 112)
!208 = !DISubprogram(name: "free", scope: !203, file: !203, line: 42, type: !209, flags: DIFlagPrototyped, spFlags: 0)
!209 = !DISubroutineType(types: !210)
!210 = !{null, !206}
!211 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !212, file: !123, line: 113)
!212 = !DISubprogram(name: "malloc", scope: !203, file: !203, line: 40, type: !213, flags: DIFlagPrototyped, spFlags: 0)
!213 = !DISubroutineType(types: !214)
!214 = !{!206, !22}
!215 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !216, file: !123, line: 114)
!216 = !DISubprogram(name: "realloc", scope: !203, file: !203, line: 43, type: !217, flags: DIFlagPrototyped, spFlags: 0)
!217 = !DISubroutineType(types: !218)
!218 = !{!206, !206, !22}
!219 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !220, file: !123, line: 115)
!220 = !DISubprogram(name: "abort", scope: !126, file: !126, line: 131, type: !221, flags: DIFlagPrototyped, spFlags: 0)
!221 = !DISubroutineType(types: !222)
!222 = !{null}
!223 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !224, file: !123, line: 116)
!224 = !DISubprogram(name: "atexit", scope: !126, file: !126, line: 133, type: !225, flags: DIFlagPrototyped, spFlags: 0)
!225 = !DISubroutineType(types: !226)
!226 = !{!40, !227}
!227 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!228 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !229, file: !123, line: 117)
!229 = !DISubprogram(name: "exit", scope: !126, file: !126, line: 145, type: !230, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!230 = !DISubroutineType(types: !231)
!231 = !{null, !40}
!232 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !233, file: !123, line: 118)
!233 = !DISubprogram(name: "_Exit", scope: !126, file: !126, line: 191, type: !230, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: 0)
!234 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !235, file: !123, line: 119)
!235 = !DISubprogram(name: "getenv", scope: !126, file: !126, line: 147, type: !236, flags: DIFlagPrototyped, spFlags: 0)
!236 = !DISubroutineType(types: !237)
!237 = !{!167, !148}
!238 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !239, file: !123, line: 120)
!239 = !DISubprogram(name: "system", linkageName: "\01_system", scope: !126, file: !126, line: 184, type: !152, flags: DIFlagPrototyped, spFlags: 0)
!240 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !241, file: !123, line: 121)
!241 = !DISubprogram(name: "bsearch", scope: !126, file: !126, line: 141, type: !242, flags: DIFlagPrototyped, spFlags: 0)
!242 = !DISubroutineType(types: !243)
!243 = !{!206, !244, !244, !22, !22, !246}
!244 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !245, size: 64)
!245 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!246 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !247, size: 64)
!247 = !DISubroutineType(types: !248)
!248 = !{!40, !244, !244}
!249 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !250, file: !123, line: 122)
!250 = !DISubprogram(name: "qsort", scope: !126, file: !126, line: 160, type: !251, flags: DIFlagPrototyped, spFlags: 0)
!251 = !DISubroutineType(types: !252)
!252 = !{null, !206, !22, !22, !246}
!253 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !254, file: !123, line: 123)
!254 = !DISubprogram(name: "abs", linkageName: "_Z3absB6v15006e", scope: !255, file: !255, line: 129, type: !256, flags: DIFlagPrototyped, spFlags: 0)
!255 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/stdlib.h", directory: "")
!256 = !DISubroutineType(types: !257)
!257 = !{!27, !27}
!258 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !259, file: !123, line: 124)
!259 = !DISubprogram(name: "labs", scope: !126, file: !126, line: 148, type: !260, flags: DIFlagPrototyped, spFlags: 0)
!260 = !DISubroutineType(types: !261)
!261 = !{!20, !20}
!262 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !263, file: !123, line: 125)
!263 = !DISubprogram(name: "llabs", scope: !126, file: !126, line: 152, type: !264, flags: DIFlagPrototyped, spFlags: 0)
!264 = !DISubroutineType(types: !265)
!265 = !{!44, !44}
!266 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !267, file: !123, line: 126)
!267 = !DISubprogram(name: "div", linkageName: "_Z3divB6v15006xx", scope: !255, file: !255, line: 152, type: !268, flags: DIFlagPrototyped, spFlags: 0)
!268 = !DISubroutineType(types: !269)
!269 = !{!138, !44, !44}
!270 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !271, file: !123, line: 127)
!271 = !DISubprogram(name: "ldiv", scope: !126, file: !126, line: 149, type: !272, flags: DIFlagPrototyped, spFlags: 0)
!272 = !DISubroutineType(types: !273)
!273 = !{!132, !20, !20}
!274 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !275, file: !123, line: 128)
!275 = !DISubprogram(name: "lldiv", scope: !126, file: !126, line: 153, type: !268, flags: DIFlagPrototyped, spFlags: 0)
!276 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !277, file: !123, line: 129)
!277 = !DISubprogram(name: "mblen", scope: !126, file: !126, line: 156, type: !278, flags: DIFlagPrototyped, spFlags: 0)
!278 = !DISubroutineType(types: !279)
!279 = !{!40, !148, !22}
!280 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !281, file: !123, line: 130)
!281 = !DISubprogram(name: "mbtowc", scope: !126, file: !126, line: 158, type: !282, flags: DIFlagPrototyped, spFlags: 0)
!282 = !DISubroutineType(types: !283)
!283 = !{!40, !284, !148, !22}
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64)
!285 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!286 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !287, file: !123, line: 131)
!287 = !DISubprogram(name: "wctomb", scope: !126, file: !126, line: 188, type: !288, flags: DIFlagPrototyped, spFlags: 0)
!288 = !DISubroutineType(types: !289)
!289 = !{!40, !167, !285}
!290 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !291, file: !123, line: 132)
!291 = !DISubprogram(name: "mbstowcs", scope: !126, file: !126, line: 157, type: !292, flags: DIFlagPrototyped, spFlags: 0)
!292 = !DISubroutineType(types: !293)
!293 = !{!22, !284, !148, !22}
!294 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !295, file: !123, line: 133)
!295 = !DISubprogram(name: "wcstombs", scope: !126, file: !126, line: 187, type: !296, flags: DIFlagPrototyped, spFlags: 0)
!296 = !DISubroutineType(types: !297)
!297 = !{!22, !167, !298, !22}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !285)
!300 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !22, file: !301, line: 69)
!301 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/cstring", directory: "")
!302 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !303, file: !301, line: 70)
!303 = !DISubprogram(name: "memcpy", scope: !304, file: !304, line: 72, type: !305, flags: DIFlagPrototyped, spFlags: 0)
!304 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/string.h", directory: "")
!305 = !DISubroutineType(types: !306)
!306 = !{!206, !206, !244, !22}
!307 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !308, file: !301, line: 71)
!308 = !DISubprogram(name: "memmove", scope: !304, file: !304, line: 73, type: !305, flags: DIFlagPrototyped, spFlags: 0)
!309 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !310, file: !301, line: 72)
!310 = !DISubprogram(name: "strcpy", scope: !304, file: !304, line: 79, type: !311, flags: DIFlagPrototyped, spFlags: 0)
!311 = !DISubroutineType(types: !312)
!312 = !{!167, !167, !148}
!313 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !314, file: !301, line: 73)
!314 = !DISubprogram(name: "strncpy", scope: !304, file: !304, line: 85, type: !315, flags: DIFlagPrototyped, spFlags: 0)
!315 = !DISubroutineType(types: !316)
!316 = !{!167, !167, !148, !22}
!317 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !318, file: !301, line: 74)
!318 = !DISubprogram(name: "strcat", scope: !304, file: !304, line: 75, type: !311, flags: DIFlagPrototyped, spFlags: 0)
!319 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !320, file: !301, line: 75)
!320 = !DISubprogram(name: "strncat", scope: !304, file: !304, line: 83, type: !315, flags: DIFlagPrototyped, spFlags: 0)
!321 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !322, file: !301, line: 76)
!322 = !DISubprogram(name: "memcmp", scope: !304, file: !304, line: 71, type: !323, flags: DIFlagPrototyped, spFlags: 0)
!323 = !DISubroutineType(types: !324)
!324 = !{!40, !244, !244, !22}
!325 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !326, file: !301, line: 77)
!326 = !DISubprogram(name: "strcmp", scope: !304, file: !304, line: 77, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!327 = !DISubroutineType(types: !328)
!328 = !{!40, !148, !148}
!329 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !330, file: !301, line: 78)
!330 = !DISubprogram(name: "strncmp", scope: !304, file: !304, line: 84, type: !331, flags: DIFlagPrototyped, spFlags: 0)
!331 = !DISubroutineType(types: !332)
!332 = !{!40, !148, !148, !22}
!333 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !334, file: !301, line: 79)
!334 = !DISubprogram(name: "strcoll", scope: !304, file: !304, line: 78, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!335 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !336, file: !301, line: 80)
!336 = !DISubprogram(name: "strxfrm", scope: !304, file: !304, line: 91, type: !337, flags: DIFlagPrototyped, spFlags: 0)
!337 = !DISubroutineType(types: !338)
!338 = !{!22, !167, !148, !22}
!339 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !340, file: !301, line: 81)
!340 = !DISubprogram(name: "memchr", linkageName: "_Z6memchrB6v15006Ua9enable_ifIXLb1EEEPvim", scope: !341, file: !341, line: 98, type: !342, flags: DIFlagPrototyped, spFlags: 0)
!341 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/string.h", directory: "")
!342 = !DISubroutineType(types: !343)
!343 = !{!206, !206, !40, !22}
!344 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !345, file: !301, line: 82)
!345 = !DISubprogram(name: "strchr", linkageName: "_Z6strchrB6v15006Ua9enable_ifIXLb1EEEPci", scope: !341, file: !341, line: 77, type: !346, flags: DIFlagPrototyped, spFlags: 0)
!346 = !DISubroutineType(types: !347)
!347 = !{!167, !167, !40}
!348 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !349, file: !301, line: 83)
!349 = !DISubprogram(name: "strcspn", scope: !304, file: !304, line: 80, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!350 = !DISubroutineType(types: !351)
!351 = !{!22, !148, !148}
!352 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !353, file: !301, line: 84)
!353 = !DISubprogram(name: "strpbrk", linkageName: "_Z7strpbrkB6v15006Ua9enable_ifIXLb1EEEPcPKc", scope: !341, file: !341, line: 84, type: !311, flags: DIFlagPrototyped, spFlags: 0)
!354 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !355, file: !301, line: 85)
!355 = !DISubprogram(name: "strrchr", linkageName: "_Z7strrchrB6v15006Ua9enable_ifIXLb1EEEPci", scope: !341, file: !341, line: 91, type: !346, flags: DIFlagPrototyped, spFlags: 0)
!356 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !357, file: !301, line: 86)
!357 = !DISubprogram(name: "strspn", scope: !304, file: !304, line: 88, type: !350, flags: DIFlagPrototyped, spFlags: 0)
!358 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !359, file: !301, line: 87)
!359 = !DISubprogram(name: "strstr", linkageName: "_Z6strstrB6v15006Ua9enable_ifIXLb1EEEPcPKc", scope: !341, file: !341, line: 105, type: !311, flags: DIFlagPrototyped, spFlags: 0)
!360 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !361, file: !301, line: 88)
!361 = !DISubprogram(name: "strtok", scope: !304, file: !304, line: 90, type: !311, flags: DIFlagPrototyped, spFlags: 0)
!362 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !363, file: !301, line: 89)
!363 = !DISubprogram(name: "memset", scope: !304, file: !304, line: 74, type: !342, flags: DIFlagPrototyped, spFlags: 0)
!364 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !365, file: !301, line: 90)
!365 = !DISubprogram(name: "strerror", linkageName: "\01_strerror", scope: !304, file: !304, line: 81, type: !366, flags: DIFlagPrototyped, spFlags: 0)
!366 = !DISubroutineType(types: !367)
!367 = !{!167, !40}
!368 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !369, file: !301, line: 91)
!369 = !DISubprogram(name: "strlen", scope: !304, file: !304, line: 82, type: !370, flags: DIFlagPrototyped, spFlags: 0)
!370 = !DISubroutineType(types: !371)
!371 = !{!22, !148}
!372 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !373, file: !426, line: 108)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !374, line: 157, baseType: !375)
!374 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_stdio.h", directory: "")
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILE", file: !374, line: 126, size: 1216, flags: DIFlagTypePassByValue, elements: !376, identifier: "_ZTS7__sFILE")
!376 = !{!377, !379, !380, !381, !382, !383, !388, !389, !390, !394, !398, !406, !410, !411, !414, !415, !419, !423, !424, !425}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !375, file: !374, line: 127, baseType: !378, size: 64)
!378 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "_r", scope: !375, file: !374, line: 128, baseType: !40, size: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "_w", scope: !375, file: !374, line: 129, baseType: !40, size: 32, offset: 96)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !375, file: !374, line: 130, baseType: !36, size: 16, offset: 128)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "_file", scope: !375, file: !374, line: 131, baseType: !36, size: 16, offset: 144)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "_bf", scope: !375, file: !374, line: 132, baseType: !384, size: 128, offset: 192)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sbuf", file: !374, line: 92, size: 128, flags: DIFlagTypePassByValue, elements: !385, identifier: "_ZTS6__sbuf")
!385 = !{!386, !387}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "_base", scope: !384, file: !374, line: 93, baseType: !378, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "_size", scope: !384, file: !374, line: 94, baseType: !40, size: 32, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "_lbfsize", scope: !375, file: !374, line: 133, baseType: !40, size: 32, offset: 320)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "_cookie", scope: !375, file: !374, line: 136, baseType: !206, size: 64, offset: 384)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "_close", scope: !375, file: !374, line: 137, baseType: !391, size: 64, offset: 448)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!40, !206}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "_read", scope: !375, file: !374, line: 138, baseType: !395, size: 64, offset: 512)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!40, !206, !167, !40}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "_seek", scope: !375, file: !374, line: 139, baseType: !399, size: 64, offset: 576)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!402, !206, !402, !40}
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "fpos_t", file: !374, line: 81, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_off_t", file: !404, line: 71, baseType: !405)
!404 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types.h", directory: "")
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !98, line: 48, baseType: !44)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "_write", scope: !375, file: !374, line: 140, baseType: !407, size: 64, offset: 640)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DISubroutineType(types: !409)
!409 = !{!40, !206, !148, !40}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "_ub", scope: !375, file: !374, line: 143, baseType: !384, size: 128, offset: 704)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "_extra", scope: !375, file: !374, line: 144, baseType: !412, size: 64, offset: 832)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "__sFILEX", file: !374, line: 98, flags: DIFlagFwdDecl | DIFlagNonTrivial, identifier: "_ZTS8__sFILEX")
!414 = !DIDerivedType(tag: DW_TAG_member, name: "_ur", scope: !375, file: !374, line: 145, baseType: !40, size: 32, offset: 896)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "_ubuf", scope: !375, file: !374, line: 148, baseType: !416, size: 24, offset: 928)
!416 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 24, elements: !417)
!417 = !{!418}
!418 = !DISubrange(count: 3)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "_nbuf", scope: !375, file: !374, line: 149, baseType: !420, size: 8, offset: 952)
!420 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 8, elements: !421)
!421 = !{!422}
!422 = !DISubrange(count: 1)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "_lb", scope: !375, file: !374, line: 152, baseType: !384, size: 128, offset: 960)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "_blksize", scope: !375, file: !374, line: 155, baseType: !40, size: 32, offset: 1088)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !375, file: !374, line: 156, baseType: !402, size: 64, offset: 1152)
!426 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/cstdio", directory: "")
!427 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !402, file: !426, line: 109)
!428 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !22, file: !426, line: 110)
!429 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !430, file: !426, line: 112)
!430 = !DISubprogram(name: "fclose", scope: !431, file: !431, line: 143, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!431 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/stdio.h", directory: "")
!432 = !DISubroutineType(types: !433)
!433 = !{!40, !434}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!435 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !436, file: !426, line: 113)
!436 = !DISubprogram(name: "fflush", scope: !431, file: !431, line: 146, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!437 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !438, file: !426, line: 114)
!438 = !DISubprogram(name: "setbuf", scope: !431, file: !431, line: 183, type: !439, flags: DIFlagPrototyped, spFlags: 0)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !434, !167}
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !442, file: !426, line: 115)
!442 = !DISubprogram(name: "setvbuf", scope: !431, file: !431, line: 184, type: !443, flags: DIFlagPrototyped, spFlags: 0)
!443 = !DISubroutineType(types: !444)
!444 = !{!40, !434, !167, !40, !22}
!445 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !446, file: !426, line: 116)
!446 = !DISubprogram(name: "fprintf", scope: !431, file: !431, line: 155, type: !447, flags: DIFlagPrototyped, spFlags: 0)
!447 = !DISubroutineType(types: !448)
!448 = !{!40, !434, !148, null}
!449 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !450, file: !426, line: 117)
!450 = !DISubprogram(name: "fscanf", scope: !431, file: !431, line: 161, type: !447, flags: DIFlagPrototyped, spFlags: 0)
!451 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !452, file: !426, line: 118)
!452 = !DISubprogram(name: "snprintf", scope: !431, file: !431, line: 344, type: !453, flags: DIFlagPrototyped, spFlags: 0)
!453 = !DISubroutineType(types: !454)
!454 = !{!40, !167, !22, !148, null}
!455 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !456, file: !426, line: 119)
!456 = !DISubprogram(name: "sprintf", scope: !431, file: !431, line: 190, type: !457, flags: DIFlagPrototyped, spFlags: 0)
!457 = !DISubroutineType(types: !458)
!458 = !{!40, !167, !148, null}
!459 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !460, file: !426, line: 120)
!460 = !DISubprogram(name: "sscanf", scope: !431, file: !431, line: 192, type: !461, flags: DIFlagPrototyped, spFlags: 0)
!461 = !DISubroutineType(types: !462)
!462 = !{!40, !148, !148, null}
!463 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !464, file: !426, line: 121)
!464 = !DISubprogram(name: "vfprintf", scope: !431, file: !431, line: 202, type: !465, flags: DIFlagPrototyped, spFlags: 0)
!465 = !DISubroutineType(types: !466)
!466 = !{!40, !434, !148, !467}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, flags: DIFlagTypePassByValue, elements: !469, identifier: "_ZTS13__va_list_tag")
!469 = !{!470, !471, !472, !473}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !468, file: !8, baseType: !56, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !468, file: !8, baseType: !56, size: 32, offset: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !468, file: !8, baseType: !206, size: 64, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !468, file: !8, baseType: !206, size: 64, offset: 128)
!474 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !475, file: !426, line: 122)
!475 = !DISubprogram(name: "vfscanf", scope: !431, file: !431, line: 345, type: !465, flags: DIFlagPrototyped, spFlags: 0)
!476 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !477, file: !426, line: 123)
!477 = !DISubprogram(name: "vsscanf", scope: !431, file: !431, line: 348, type: !478, flags: DIFlagPrototyped, spFlags: 0)
!478 = !DISubroutineType(types: !479)
!479 = !{!40, !148, !148, !467}
!480 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !481, file: !426, line: 124)
!481 = !DISubprogram(name: "vsnprintf", scope: !431, file: !431, line: 347, type: !482, flags: DIFlagPrototyped, spFlags: 0)
!482 = !DISubroutineType(types: !483)
!483 = !{!40, !167, !22, !148, !467}
!484 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !485, file: !426, line: 125)
!485 = !DISubprogram(name: "vsprintf", scope: !431, file: !431, line: 209, type: !486, flags: DIFlagPrototyped, spFlags: 0)
!486 = !DISubroutineType(types: !487)
!487 = !{!40, !167, !148, !467}
!488 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !489, file: !426, line: 126)
!489 = !DISubprogram(name: "fgetc", scope: !431, file: !431, line: 147, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!490 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !491, file: !426, line: 127)
!491 = !DISubprogram(name: "fgets", scope: !431, file: !431, line: 149, type: !492, flags: DIFlagPrototyped, spFlags: 0)
!492 = !DISubroutineType(types: !493)
!493 = !{!167, !167, !40, !434}
!494 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !495, file: !426, line: 128)
!495 = !DISubprogram(name: "fputc", scope: !431, file: !431, line: 156, type: !496, flags: DIFlagPrototyped, spFlags: 0)
!496 = !DISubroutineType(types: !497)
!497 = !{!40, !40, !434}
!498 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !499, file: !426, line: 129)
!499 = !DISubprogram(name: "fputs", linkageName: "\01_fputs", scope: !431, file: !431, line: 157, type: !500, flags: DIFlagPrototyped, spFlags: 0)
!500 = !DISubroutineType(types: !501)
!501 = !{!40, !148, !434}
!502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !503, file: !426, line: 130)
!503 = !DISubprogram(name: "getc", scope: !431, file: !431, line: 166, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!504 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !505, file: !426, line: 131)
!505 = !DISubprogram(name: "putc", scope: !431, file: !431, line: 176, type: !496, flags: DIFlagPrototyped, spFlags: 0)
!506 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !507, file: !426, line: 132)
!507 = !DISubprogram(name: "ungetc", scope: !431, file: !431, line: 201, type: !496, flags: DIFlagPrototyped, spFlags: 0)
!508 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !509, file: !426, line: 133)
!509 = !DISubprogram(name: "fread", scope: !431, file: !431, line: 158, type: !510, flags: DIFlagPrototyped, spFlags: 0)
!510 = !DISubroutineType(types: !511)
!511 = !{!22, !206, !22, !22, !434}
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !513, file: !426, line: 134)
!513 = !DISubprogram(name: "fwrite", linkageName: "\01_fwrite", scope: !431, file: !431, line: 165, type: !514, flags: DIFlagPrototyped, spFlags: 0)
!514 = !DISubroutineType(types: !515)
!515 = !{!22, !244, !22, !22, !434}
!516 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !517, file: !426, line: 136)
!517 = !DISubprogram(name: "fgetpos", scope: !431, file: !431, line: 148, type: !518, flags: DIFlagPrototyped, spFlags: 0)
!518 = !DISubroutineType(types: !519)
!519 = !{!40, !434, !520}
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!521 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !522, file: !426, line: 138)
!522 = !DISubprogram(name: "fseek", scope: !431, file: !431, line: 162, type: !523, flags: DIFlagPrototyped, spFlags: 0)
!523 = !DISubroutineType(types: !524)
!524 = !{!40, !434, !20, !40}
!525 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !526, file: !426, line: 140)
!526 = !DISubprogram(name: "fsetpos", scope: !431, file: !431, line: 163, type: !527, flags: DIFlagPrototyped, spFlags: 0)
!527 = !DISubroutineType(types: !528)
!528 = !{!40, !434, !529}
!529 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !530, size: 64)
!530 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !402)
!531 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !532, file: !426, line: 142)
!532 = !DISubprogram(name: "ftell", scope: !431, file: !431, line: 164, type: !533, flags: DIFlagPrototyped, spFlags: 0)
!533 = !DISubroutineType(types: !534)
!534 = !{!20, !434}
!535 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !536, file: !426, line: 143)
!536 = !DISubprogram(name: "rewind", scope: !431, file: !431, line: 181, type: !537, flags: DIFlagPrototyped, spFlags: 0)
!537 = !DISubroutineType(types: !538)
!538 = !{null, !434}
!539 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !540, file: !426, line: 144)
!540 = !DISubprogram(name: "clearerr", scope: !431, file: !431, line: 142, type: !537, flags: DIFlagPrototyped, spFlags: 0)
!541 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !542, file: !426, line: 145)
!542 = !DISubprogram(name: "feof", scope: !431, file: !431, line: 144, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!543 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !544, file: !426, line: 146)
!544 = !DISubprogram(name: "ferror", scope: !431, file: !431, line: 145, type: !432, flags: DIFlagPrototyped, spFlags: 0)
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !546, file: !426, line: 147)
!546 = !DISubprogram(name: "perror", scope: !431, file: !431, line: 174, type: !547, flags: DIFlagPrototyped, spFlags: 0)
!547 = !DISubroutineType(types: !548)
!548 = !{null, !148}
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !550, file: !426, line: 149)
!550 = !DISubprogram(name: "fopen", linkageName: "\01_fopen", scope: !431, file: !431, line: 153, type: !551, flags: DIFlagPrototyped, spFlags: 0)
!551 = !DISubroutineType(types: !552)
!552 = !{!434, !148, !148}
!553 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !554, file: !426, line: 150)
!554 = !DISubprogram(name: "freopen", linkageName: "\01_freopen", scope: !431, file: !431, line: 159, type: !555, flags: DIFlagPrototyped, spFlags: 0)
!555 = !DISubroutineType(types: !556)
!556 = !{!434, !148, !148, !434}
!557 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !558, file: !426, line: 152)
!558 = !DISubprogram(name: "remove", scope: !431, file: !431, line: 179, type: !152, flags: DIFlagPrototyped, spFlags: 0)
!559 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !560, file: !426, line: 154)
!560 = !DISubprogram(name: "rename", scope: !431, file: !431, line: 180, type: !327, flags: DIFlagPrototyped, spFlags: 0)
!561 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !562, file: !426, line: 155)
!562 = !DISubprogram(name: "tmpfile", scope: !431, file: !431, line: 193, type: !563, flags: DIFlagPrototyped, spFlags: 0)
!563 = !DISubroutineType(types: !564)
!564 = !{!434}
!565 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !566, file: !426, line: 156)
!566 = !DISubprogram(name: "tmpnam", scope: !431, file: !431, line: 199, type: !567, flags: DIFlagPrototyped, spFlags: 0)
!567 = !DISubroutineType(types: !568)
!568 = !{!167, !167}
!569 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !570, file: !426, line: 158)
!570 = !DISubprogram(name: "getchar", scope: !431, file: !431, line: 167, type: !195, flags: DIFlagPrototyped, spFlags: 0)
!571 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !572, file: !426, line: 160)
!572 = !DISubprogram(name: "gets", scope: !431, file: !431, line: 172, type: !567, flags: DIFlagPrototyped, spFlags: 0)
!573 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !574, file: !426, line: 162)
!574 = !DISubprogram(name: "scanf", scope: !431, file: !431, line: 182, type: !575, flags: DIFlagPrototyped, spFlags: 0)
!575 = !DISubroutineType(types: !576)
!576 = !{!40, !148, null}
!577 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !578, file: !426, line: 163)
!578 = !DISubprogram(name: "vscanf", scope: !431, file: !431, line: 346, type: !579, flags: DIFlagPrototyped, spFlags: 0)
!579 = !DISubroutineType(types: !580)
!580 = !{!40, !148, !467}
!581 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !582, file: !426, line: 165)
!582 = !DISubprogram(name: "printf", scope: !431, file: !431, line: 175, type: !575, flags: DIFlagPrototyped, spFlags: 0)
!583 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !584, file: !426, line: 166)
!584 = !DISubprogram(name: "putchar", scope: !431, file: !431, line: 177, type: !585, flags: DIFlagPrototyped, spFlags: 0)
!585 = !DISubroutineType(types: !586)
!586 = !{!40, !40}
!587 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !588, file: !426, line: 167)
!588 = !DISubprogram(name: "puts", scope: !431, file: !431, line: 178, type: !152, flags: DIFlagPrototyped, spFlags: 0)
!589 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !590, file: !426, line: 168)
!590 = !DISubprogram(name: "vprintf", scope: !431, file: !431, line: 203, type: !579, flags: DIFlagPrototyped, spFlags: 0)
!591 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !592, file: !594, line: 104)
!592 = !DISubprogram(name: "isalnum", linkageName: "_Z7isalnumi", scope: !593, file: !593, line: 212, type: !585, flags: DIFlagPrototyped, spFlags: 0)
!593 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_ctype.h", directory: "")
!594 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/cctype", directory: "")
!595 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !596, file: !594, line: 105)
!596 = !DISubprogram(name: "isalpha", linkageName: "_Z7isalphai", scope: !593, file: !593, line: 218, type: !585, flags: DIFlagPrototyped, spFlags: 0)
!597 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !598, file: !594, line: 106)
!598 = !DISubprogram(name: "isblank", linkageName: "_Z7isblanki", scope: !593, file: !593, line: 224, type: !585, flags: DIFlagPrototyped, spFlags: 0)
!599 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !600, file: !594, line: 107)
!600 = !DISubprogram(name: "iscntrl", linkageName: "_Z7iscntrli", scope: !593, file: !593, line: 230, type: !585, flags: DIFlagPrototyped, spFlags: 0)
!601 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !602, file: !594, line: 108)
!602 = !DISubprogram(name: "isdigit", linkageName: "_Z7isdigiti", scope: !593, file: !593, line: 237, type: !585, flags: DIFlagPrototyped, spFlags: 0)
!603 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !604, file: !594, line: 109)
!604 = !DISubprogram(name: "isgraph", linkageName: "_Z7isgraphi", scope: !593, file: !593, line: 243, type: !585, flags: DIFlagPrototyped, spFlags: 0)
!605 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !606, file: !594, line: 110)
!606 = !DISubprogram(name: "islower", linkageName: "_Z7isloweri", scope: !593, file: !593, line: 249, type: !585, flags: DIFlagPrototyped, spFlags: 0)
!607 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !608, file: !594, line: 111)
!608 = !DISubprogram(name: "isprint", linkageName: "_Z7isprinti", scope: !593, file: !593, line: 255, type: !585, flags: DIFlagPrototyped, spFlags: 0)
!609 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !610, file: !594, line: 112)
!610 = !DISubprogram(name: "ispunct", linkageName: "_Z7ispuncti", scope: !593, file: !593, line: 261, type: !585, flags: DIFlagPrototyped, spFlags: 0)
!611 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !612, file: !594, line: 113)
!612 = !DISubprogram(name: "isspace", linkageName: "_Z7isspacei", scope: !593, file: !593, line: 267, type: !585, flags: DIFlagPrototyped, spFlags: 0)
!613 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !614, file: !594, line: 114)
!614 = !DISubprogram(name: "isupper", linkageName: "_Z7isupperi", scope: !593, file: !593, line: 273, type: !585, flags: DIFlagPrototyped, spFlags: 0)
!615 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !616, file: !594, line: 115)
!616 = !DISubprogram(name: "isxdigit", linkageName: "_Z8isxdigiti", scope: !593, file: !593, line: 280, type: !585, flags: DIFlagPrototyped, spFlags: 0)
!617 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !618, file: !594, line: 116)
!618 = !DISubprogram(name: "tolower", linkageName: "_Z7toloweri", scope: !593, file: !593, line: 292, type: !585, flags: DIFlagPrototyped, spFlags: 0)
!619 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !620, file: !594, line: 117)
!620 = !DISubprogram(name: "toupper", linkageName: "_Z7toupperi", scope: !593, file: !593, line: 298, type: !585, flags: DIFlagPrototyped, spFlags: 0)
!621 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !622, file: !625, line: 64)
!622 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !623, line: 32, baseType: !624)
!623 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/sys/_types/_wint_t.h", directory: "")
!624 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wint_t", file: !98, line: 114, baseType: !40)
!625 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/cwctype", directory: "")
!626 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !627, file: !625, line: 65)
!627 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctrans_t", file: !628, line: 32, baseType: !629)
!628 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_wctrans_t.h", directory: "")
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctrans_t", file: !630, line: 41, baseType: !40)
!630 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types.h", directory: "")
!631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !632, file: !625, line: 66)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "wctype_t", file: !633, line: 32, baseType: !634)
!633 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_types/_wctype_t.h", directory: "")
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "__darwin_wctype_t", file: !630, line: 43, baseType: !635)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !98, line: 47, baseType: !56)
!636 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !637, file: !625, line: 67)
!637 = !DISubprogram(name: "iswalnum", linkageName: "_Z8iswalnumi", scope: !638, file: !638, line: 51, type: !639, flags: DIFlagPrototyped, spFlags: 0)
!638 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/_wctype.h", directory: "")
!639 = !DISubroutineType(types: !640)
!640 = !{!40, !622}
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !642, file: !625, line: 68)
!642 = !DISubprogram(name: "iswalpha", linkageName: "_Z8iswalphai", scope: !638, file: !638, line: 57, type: !639, flags: DIFlagPrototyped, spFlags: 0)
!643 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !644, file: !625, line: 69)
!644 = !DISubprogram(name: "iswblank", linkageName: "_Z8iswblanki", scope: !645, file: !645, line: 50, type: !639, flags: DIFlagPrototyped, spFlags: 0)
!645 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/wctype.h", directory: "")
!646 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !647, file: !625, line: 70)
!647 = !DISubprogram(name: "iswcntrl", linkageName: "_Z8iswcntrli", scope: !638, file: !638, line: 63, type: !639, flags: DIFlagPrototyped, spFlags: 0)
!648 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !649, file: !625, line: 71)
!649 = !DISubprogram(name: "iswdigit", linkageName: "_Z8iswdigiti", scope: !638, file: !638, line: 75, type: !639, flags: DIFlagPrototyped, spFlags: 0)
!650 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !651, file: !625, line: 72)
!651 = !DISubprogram(name: "iswgraph", linkageName: "_Z8iswgraphi", scope: !638, file: !638, line: 81, type: !639, flags: DIFlagPrototyped, spFlags: 0)
!652 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !653, file: !625, line: 73)
!653 = !DISubprogram(name: "iswlower", linkageName: "_Z8iswloweri", scope: !638, file: !638, line: 87, type: !639, flags: DIFlagPrototyped, spFlags: 0)
!654 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !655, file: !625, line: 74)
!655 = !DISubprogram(name: "iswprint", linkageName: "_Z8iswprinti", scope: !638, file: !638, line: 93, type: !639, flags: DIFlagPrototyped, spFlags: 0)
!656 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !657, file: !625, line: 75)
!657 = !DISubprogram(name: "iswpunct", linkageName: "_Z8iswpuncti", scope: !638, file: !638, line: 99, type: !639, flags: DIFlagPrototyped, spFlags: 0)
!658 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !659, file: !625, line: 76)
!659 = !DISubprogram(name: "iswspace", linkageName: "_Z8iswspacei", scope: !638, file: !638, line: 105, type: !639, flags: DIFlagPrototyped, spFlags: 0)
!660 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !661, file: !625, line: 77)
!661 = !DISubprogram(name: "iswupper", linkageName: "_Z8iswupperi", scope: !638, file: !638, line: 111, type: !639, flags: DIFlagPrototyped, spFlags: 0)
!662 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !663, file: !625, line: 78)
!663 = !DISubprogram(name: "iswxdigit", linkageName: "_Z9iswxdigiti", scope: !638, file: !638, line: 117, type: !639, flags: DIFlagPrototyped, spFlags: 0)
!664 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !665, file: !625, line: 79)
!665 = !DISubprogram(name: "iswctype", linkageName: "_Z8iswctypeij", scope: !638, file: !638, line: 69, type: !666, flags: DIFlagPrototyped, spFlags: 0)
!666 = !DISubroutineType(types: !667)
!667 = !{!40, !622, !632}
!668 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !669, file: !625, line: 80)
!669 = !DISubprogram(name: "wctype", scope: !638, file: !638, line: 157, type: !670, flags: DIFlagPrototyped, spFlags: 0)
!670 = !DISubroutineType(types: !671)
!671 = !{!632, !148}
!672 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !673, file: !625, line: 81)
!673 = !DISubprogram(name: "towlower", linkageName: "_Z8towloweri", scope: !638, file: !638, line: 123, type: !674, flags: DIFlagPrototyped, spFlags: 0)
!674 = !DISubroutineType(types: !675)
!675 = !{!622, !622}
!676 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !677, file: !625, line: 82)
!677 = !DISubprogram(name: "towupper", linkageName: "_Z8towupperi", scope: !638, file: !638, line: 129, type: !674, flags: DIFlagPrototyped, spFlags: 0)
!678 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !679, file: !625, line: 83)
!679 = !DISubprogram(name: "towctrans", scope: !645, file: !645, line: 121, type: !680, flags: DIFlagPrototyped, spFlags: 0)
!680 = !DISubroutineType(types: !681)
!681 = !{!622, !622, !627}
!682 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !683, file: !625, line: 84)
!683 = !DISubprogram(name: "wctrans", scope: !645, file: !645, line: 123, type: !684, flags: DIFlagPrototyped, spFlags: 0)
!684 = !DISubroutineType(types: !685)
!685 = !{!627, !148}
!686 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !109, file: !687, line: 116)
!687 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/c++/v1/cwchar", directory: "")
!688 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !22, file: !687, line: 117)
!689 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !690, file: !687, line: 118)
!690 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !691, line: 75, size: 448, flags: DIFlagTypePassByValue, elements: !692, identifier: "_ZTS2tm")
!691 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/time.h", directory: "")
!692 = !{!693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !690, file: !691, line: 76, baseType: !40, size: 32)
!694 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !690, file: !691, line: 77, baseType: !40, size: 32, offset: 32)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !690, file: !691, line: 78, baseType: !40, size: 32, offset: 64)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !690, file: !691, line: 79, baseType: !40, size: 32, offset: 96)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !690, file: !691, line: 80, baseType: !40, size: 32, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !690, file: !691, line: 81, baseType: !40, size: 32, offset: 160)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !690, file: !691, line: 82, baseType: !40, size: 32, offset: 192)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !690, file: !691, line: 83, baseType: !40, size: 32, offset: 224)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !690, file: !691, line: 84, baseType: !40, size: 32, offset: 256)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !690, file: !691, line: 85, baseType: !20, size: 64, offset: 320)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !690, file: !691, line: 86, baseType: !167, size: 64, offset: 384)
!704 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !622, file: !687, line: 119)
!705 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !373, file: !687, line: 120)
!706 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !707, file: !687, line: 121)
!707 = !DISubprogram(name: "fwprintf", scope: !708, file: !708, line: 103, type: !709, flags: DIFlagPrototyped, spFlags: 0)
!708 = !DIFile(filename: "/Library/Developer/CommandLineTools/SDKs/MacOSX.sdk/usr/include/wchar.h", directory: "")
!709 = !DISubroutineType(types: !710)
!710 = !{!40, !434, !298, null}
!711 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !712, file: !687, line: 122)
!712 = !DISubprogram(name: "fwscanf", scope: !708, file: !708, line: 104, type: !709, flags: DIFlagPrototyped, spFlags: 0)
!713 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !714, file: !687, line: 123)
!714 = !DISubprogram(name: "swprintf", scope: !708, file: !708, line: 115, type: !715, flags: DIFlagPrototyped, spFlags: 0)
!715 = !DISubroutineType(types: !716)
!716 = !{!40, !284, !22, !298, null}
!717 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !718, file: !687, line: 124)
!718 = !DISubprogram(name: "vfwprintf", scope: !708, file: !708, line: 118, type: !719, flags: DIFlagPrototyped, spFlags: 0)
!719 = !DISubroutineType(types: !720)
!720 = !{!40, !434, !298, !467}
!721 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !722, file: !687, line: 125)
!722 = !DISubprogram(name: "vswprintf", scope: !708, file: !708, line: 120, type: !723, flags: DIFlagPrototyped, spFlags: 0)
!723 = !DISubroutineType(types: !724)
!724 = !{!40, !284, !22, !298, !467}
!725 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !726, file: !687, line: 126)
!726 = !DISubprogram(name: "swscanf", scope: !708, file: !708, line: 116, type: !727, flags: DIFlagPrototyped, spFlags: 0)
!727 = !DISubroutineType(types: !728)
!728 = !{!40, !298, !298, null}
!729 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !730, file: !687, line: 127)
!730 = !DISubprogram(name: "vfwscanf", scope: !708, file: !708, line: 170, type: !719, flags: DIFlagPrototyped, spFlags: 0)
!731 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !732, file: !687, line: 128)
!732 = !DISubprogram(name: "vswscanf", scope: !708, file: !708, line: 172, type: !733, flags: DIFlagPrototyped, spFlags: 0)
!733 = !DISubroutineType(types: !734)
!734 = !{!40, !298, !298, !467}
!735 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !736, file: !687, line: 129)
!736 = !DISubprogram(name: "fgetwc", scope: !708, file: !708, line: 98, type: !737, flags: DIFlagPrototyped, spFlags: 0)
!737 = !DISubroutineType(types: !738)
!738 = !{!622, !434}
!739 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !740, file: !687, line: 130)
!740 = !DISubprogram(name: "fgetws", scope: !708, file: !708, line: 99, type: !741, flags: DIFlagPrototyped, spFlags: 0)
!741 = !DISubroutineType(types: !742)
!742 = !{!284, !284, !40, !434}
!743 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !744, file: !687, line: 131)
!744 = !DISubprogram(name: "fputwc", scope: !708, file: !708, line: 100, type: !745, flags: DIFlagPrototyped, spFlags: 0)
!745 = !DISubroutineType(types: !746)
!746 = !{!622, !285, !434}
!747 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !11, entity: !748, file: !687, line: 132)
!748 = !DISubprogram(name: "fputws", scope: !708, file: !708, line: 101, type: !749, flags: DIFlagPrototyped, spFlags: 0)
!749 = !DISubroutineType(types: !750)
!750 = !{!40, !298, !434}
